Autodesk.Revit.DB.Structure.RebarConstraint.GetDirectionFromTargetToConstrainedHandle(System.Boolean)
Gets a direction from target handle to the handle that is obtained by executing this constraint.
treatAsPreferred:
If target rebar joins to the outside of cover, its handle surface's orientation should be revised according to cover reference. If treatAsPreferred is true will ignore the cover;
Returns:
Returns a direction from target handle to the handle that is obtained by executing this constraint.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The RebarConstraint constrain two Rebar ends.
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
-or-
The RebarConstraint is not using clear bar distance with zero offset to the target rebar.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.IsValidSurfaceToConstraintHandleTo(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,Autodesk.Revit.DB.Surface)
Checks if the surface can be used to create a constraint to it for the input handle.
Remarks:
If the handle belongs to a free from rebar will return false.
If the input plane is almost perpendicular (the angle between surfaces is between 84 or 96 degrees) will return false.
If the input handle is Rebar Plane or Out Of Plane Extents and the surface isn't a plane will return false.
If the input handle is a segment of a bar whose shape has a RebarShapeDefinitionBySegments definition and the surface isn't a cylinder surface will return false.
For any other cases will return true
handle:
The handle of the rebar that will be constrained.
surface:
The surface that will be tested.
Returns:
Returns true if the surface can be used to create a constraint to it for the input handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarConstraint.HasAnEdgeNumber
Checks if the getTargetRebarEdgeNumber method can be called for the RebarConstraint.
Remarks:
The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar,' and the
RebarTargetConstraintType must be 'Edge' or 'BarBend'.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.IsToHostFaceOrCover
Returns true if the RebarConstraintType of the RebarConstraint is either 'FixedDistanceToHostFace' or 'ToCover'.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.IsToSurface
Checks if the RebarConstraintType of the RebarConstraint is 'ToSurface'.
Returns:
Returns true if the RebarConstraintType of the RebarConstraint is 'ToSurface', false otherwise.
Since:
2025

Autodesk.Revit.DB.Structure.RebarConstraint.IsToOtherRebar
Checks if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar'.
Returns:
Returns true if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar', false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.IsToCover
Checks if the RebarConstraintType of the RebarConstraint is 'ToCover'.
Returns true if the RebarConstraintType of the RebarConstraint is 'ToCover', false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.IsFixedDistanceToHostFace
Checks if the RebarConstraintType of the RebarConstraint is 'FixedDistanceToHostFace'.
Returns:
Returns true if the RebarConstraintType of the RebarConstraint is 'FixedDistanceToHostFace', false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.FlipSideForClearBarSpacingZeroDistanceConstraint
Flips the side on which a RebarConstrainedHandle constrained using clear bar distance with zero offset connects to another Rebar target handle.
Remarks:
This is available only for constraints of type Autodesk.Revit.DB.Structure.RebarConstraintType.ToOtherRebar, using clear bar distance with zero offset.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The RebarConstraint constrain two Rebar ends.
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
-or-
The RebarConstraint is not using clear bar distance with zero offset to the target rebar.
Since:
2025

Autodesk.Revit.DB.Structure.RebarConstraint.GetPositiveOffsetDirectionForToOtherRebarConstraint
Returns the positive offset direction vector.
Remarks:
This is available only for constraints of type Autodesk.Revit.DB.Structure.RebarConstraintType.ToOtherRebar.
Valid  Autodesk.Revit.DB.Structure.TargetRebarConstraintType are:
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.RebarPlane
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.Edge
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.OutOfPlaneExtent
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.StartOfBar, only if the RebarShape has a definition of Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition with RebarShapeMultiplanarDefinition::IsStartConnectorPressent
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.EndOfBar, only if the RebarShape has a definition of Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition with RebarShapeMultiplanarDefinition::IsEndConnectorPressent
Returns:
The positive offset direction vector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The TargetRebarConstraintType is not valid.
Since:
2024

Autodesk.Revit.DB.Structure.RebarConstraint.FlipHandleOverTarget
Flips the RebarConstrainedHandle to the other side of the target bar handle, maintaining the distance in absolute value.
Remarks:
Throw exception if constraint type is not 'ToOtherRebar', or for constraints involving bar/hook bend handle.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.SetToUseClearBarSpacing(System.Boolean)
Sets whether the RebarConstrainedHandle to target offset is the clear bar distance, or is measured between bar centers.
Remarks:
Throw exception if it's used on start/end handle to start/end handle constraint, and on constraints involving bar/hook bend handle.
useClearBarSpacing:
True if the RebarConstrainedHandle to target offset is the clear bar distance, false if the offset is measured between bar centers.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The RebarConstraint constrain two Rebar ends.
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.IsUsingClearBarSpacing
Returns true if the RebarConstrainedHandle to target offset is the clear bar distance, false if the offset is measured between bar centers.
Remarks:
Throw exception if it's used on start/end handle to start/end handle constraint, and on constraints involving bar/hook bend handle.
Returns:
Returns true if the RebarConstrainedHandle to target offset is the clear bar distance, false if the offset is measured between bar centers.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The RebarConstraint constrain two Rebar ends.
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.SetToBindHandleWithTarget(System.Boolean)
Sets the relationship between two RebarConstrainedHandles.
Remarks:
Throws exception for any type of constraint other than 'ToOtherRebar' or if the RebarTargetConstraintType of the constraint is 'HookBend' or 'BarBend'.
Will also throw if the target Rebar has the 'Number with Spacing' layout rule and the RebarTargetConstraintType of the constraint is 'OutOfPlaneExtent'.
bindsHandleWithTarget:
False if only the constrained RebarConstrainedHandle follows the target. True if the constrained RebarConstrainedHandle and the target bar handle will be bound and move together.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
-or-
The RebarTargetConstraintType is 'OutOfPlaneExtent' and the rebar target layout is 'Number with Spacing'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.IsBindingHandleWithTarget
Gets the relationship between two RebarConstrainedHandles.
Remarks:
Throws exception for any type of constraint other than 'ToOtherRebar' or if the RebarTargetConstraintType of the constraint is 'HookBend' or 'BarBend'.
Will also throw if the target Rebar has the 'Number with Spacing' layout rule and the RebarTargetConstraintType of the constraint is 'OutOfPlaneExtent'.
Returns:
Returns False if only the constrained RebarConstrainedHandle follows the target. Returns True if the constrained RebarConstrainedHandle and the target bar handle are bound and move together.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
-or-
The RebarTargetConstraintType is 'OutOfPlaneExtent' and the rebar target layout is 'Number with Spacing'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.SetDistanceToTargetRebar(System.Double)
Sets the offset distance between the constrained RebarConstrainedHandle and its target Rebar handle surface.
Remarks:
Throws exception if the constraint is not to other rebar or if the target constraint is to bar bend or hook bend.
distanceToTargetRebar:
The distance is given as an offset value, the sign of which depends on the target bar handle direction.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for distanceToTargetRebar must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.GetDistanceToTargetRebar
Gets the distance from the RebarConstrainedHandle to the target Rebar handle surface.
The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar'.
Remarks:
Throws exception if the constraint is not to other rebar or if the target constraint is to bar bend or hook bend.
Returns:
Returns the distance from the RebarConstrainedHandle to the target Rebar handle surface.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.ReplaceReferenceTargets(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},System.Boolean,System.Double)
Replaces the current set of references, the type of constraint and the offset value, with the newly provided ones.
Will throw exception if this is a constraint for Shape Driven Rebar.
handle:
The RebarConstrainedHandle that has this constraint.
targetReferences:
The references to which the rebar handle will be constrained.
This collection must contain one or more references to faces of elements that can host rebar.
isConstraintToCover:
If true the RebarConstraintType will be set to ToCover, otherwise RebarConstraintType will be set to FixedDistanceToHostFace.
offsetValue:
The distance from references to the rebar handle.
Throws Autodesk.Revit.Exceptions.ArgumentException:
handle is no longer valid.
-or-
targetReferences is empty.
-or-
targetReferences do not represent faces from structurals that can host rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Constrained rebar isn't a free form rebar element.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.GetCustomHandleTag
Returns the handle tag of the RebarConstrainedHandle.
This is valid only for Free Form Rebar.
Returns:
Returns the handle tag of the RebarConstrainedHandle.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Constrained rebar isn't a free form rebar element.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.GetSurfaceForConstraintToSurface
This method retrieves the surface for a constraint of 'To Surface' type.
Returns:
Returns the surface that the RebarConstraint of 'To Surface' type is using.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToSurface'.
Since:
2025

Autodesk.Revit.DB.Structure.RebarConstraint.CreateConstraintToSurface(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,Autodesk.Revit.DB.Surface)
This method creates a constraint of 'To Surface' type for a given RebarConstrainedHandle.
The RebarConstrainedHandle should belong to a shape driven rebar, otherwise it will throw exception.
handle:
The handle of the rebar that will be constrained.
surface:
The surface that will be used by the constraint.
Returns:
Returns the newly created RebarConstraint.
Throws Autodesk.Revit.Exceptions.ArgumentException:
handle is no longer valid.
-or-
Constrained rebar isn't a shape driven rebar element.
-or-
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarConstraint.Create(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},System.Boolean,System.Double)
This method creates a constraint for a given RebarConstrainedHandle.
Will throw exception if used for Shape Driven Rebar.
handle:
The handle of the rebar that will be constrained.
targetReferences:
The references to which the rebar handle will be constrained.
This collection must contain one or more references to faces of elements that can host rebar.
isConstraintToCover:
If true the RebarConstraintType will be set to ToCover, otherwise RebarConstraintType will be set to FixedDistanceToHostFace.
offsetValue:
The distance from references to the rebar handle.
Returns:
Returns the newly created RebarConstraint.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Constrained rebar isn't a free form rebar element.
-or-
handle is no longer valid.
-or-
targetReferences is empty.
-or-
targetReferences do not represent faces from structurals that can host rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.IsEqual(Autodesk.Revit.DB.Structure.RebarConstraint)
Checks if the specified RebarConstraint is the same as 'this'. The method
can be used to determine which of the RebarConstraint candidates offered by the
RebarConstraintsManager is currently active.
other:
RebarConstraint to compare with.
Returns:
Returns true if the specified RebarConstraint is the same as 'this', false otherwise
Throws Autodesk.Revit.Exceptions.ArgumentException:
other is no longer valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarAngleOnBarOrHookBend
Returns the angular increment along a bar or hook bend to which the RebarConstraint is attached.
Remarks:
Only applies to RebarConstraints with TargetRebarConstraintType BarBend or HookBend.
For HookBends, values can be 0, 1, 2, 3 or 4, representing angular locations of 0, 45, 90, 135,
and 180 degrees around the hook, starting at the 'base' of the hook (or end of the bar without hook).
For interior BarBends, values can 0 or 1, where 0 means at the intersection of the bar bend and the edge
specified by getTargetRebarEdgeNumber, and 1 means the mid-point of the bend arc.
Rebar must be Shape Driven Rebar element.
Returns:
The angular increment relative to the reference bar edge.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The RebarTargetConstraintType is not 'HookBend' or 'BarBend'.
-or-
Constrained rebar isn't a shape driven rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarHookBarEnd
Returns 0 or 1 to indicate which end hook on the other Rebar Element to which this RebarConstraint is attached.
The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType
must be 'HookBend'.
Rebar must be Shape Driven Rebar element.
Remarks:
0 means start of the bar, and 1 indicates end of the bar.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The RebarTargetConstraintType is not 'HookBend'
-or-
Constrained rebar isn't a shape driven rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarBendNumber
Returns the number of the bend on the other Rebar Element to which this RebarConstraint is attached.
The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType
must be 'BarBend'.
Rebar must be Shape Driven Rebar element.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The RebarTargetConstraintType is not 'BarBend'
-or-
Constrained rebar isn't a shape driven rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarEdgeNumber
Returns the number of the edge on the other Rebar Element to which this RebarConstraint is attached.
The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType
must be 'Edge'.
Rebar must be Shape Driven Rebar element.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The RebarConstraint is not attached to an edge, or bend, or hook bend of another Rebar Element.
-or-
Constrained rebar isn't a shape driven rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarConstraintType
Returns the TargetRebarConstraintType of the handle on the other Rebar Element
to which this RebarConstraint is attached. The RebarConstraintType of the
RebarConstraint must be 'ToOtherRebar'.
Rebar must be Shape Driven Rebar element.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
Constrained rebar isn't a shape driven rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.SetDistanceToTargetCover(System.Double)
Sets the distance from the RebarConstrainedHandle to the target Host Cover Element surface.
The RebarConstraintType of the RebarConstraint must be 'ToCover'.
distanceToTargetCover:
The distance is given as an offset value, the sign of which depends on Host Cover direction.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for distanceToTargetCover must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToCover'.
Since:
2016

Autodesk.Revit.DB.Structure.RebarConstraint.GetDistanceToTargetCover
Returns the distance from the RebarConstrainedHandle to the target Host Cover Element surface.
The RebarConstraintType of the RebarConstraint must be 'ToCover'.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToCover'.
Since:
2016

Autodesk.Revit.DB.Structure.RebarConstraint.SetDistanceToTargetHostFace(System.Double)
Sets the distance from the RebarConstrainedHandle to the target Host Element surface.
The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace'.
offset:
The distance is given as an offset value, the sign of which depends on Host Face direction.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for offset must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace'.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetDistanceToTargetHostFace
Returns the distance from the RebarConstrainedHandle to the target Host Element surface.
The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace'.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace'.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetHostFaceReference
Returns a reference to the host Element face to which the RebarConstraint is attached.
The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'.
Will throw exception if it's a multi target constraint.
Returns:
Requested reference.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover'.
-or-
Multi target constraint. Consider using the indexed version of the method.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetHostFaceReference(System.Int32)
Returns a reference that corresponds to the face to which the RebarConstraint is attached specified by the targetIndex.
The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'.
targetIndex:
The index of the target. Should be between 0 and NumberOfTargets().
Returns:
Requested reference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
targetIndex is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover'.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetCoverType(System.Int32)
Returns the RebarCoverType for the face specified by targetIndex. Returns null if no RebarHostData is present for target element.
targetIndex:
The index of the target. Should be between 0 and NumberOfTargets().
Throws Autodesk.Revit.Exceptions.ArgumentException:
targetIndex is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover'.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetHostFaceAndTransform(System.Int32,Autodesk.Revit.DB.Transform)
Returns the face to which the RebarConstraint is attached associated to the given target index.
The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'.
targetIndex:
The index of the target. Should be between 0 and NumberOfTargets().
faceTransform:
Returns the transform that is associated to the face's element geometry.
Returns:
Requested Face.
Throws Autodesk.Revit.Exceptions.ArgumentException:
targetIndex is out of range.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover'.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.GetRebarConstraintTargetHostFaceType
Returns the RebarConstraintTargetHostFaceType of the host Element face to which
the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint
must be 'FixedDistanceToHostFace' or 'ToCover'.
Will throw exception if it's a multi target constraint.
Returns:
Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover'.
-or-
Multi target constraint. Consider using the indexed version of the method.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetRebarConstraintTargetHostFaceType(System.Int32)
Returns the RebarConstraintTargetHostFaceType of the host Element face to which
the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint
must be 'FixedDistanceToHostFace' or 'ToCover'.
targetIndex:
The index of the target. Should be between 0 and NumberOfTargets().
Returns:
Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached.
Throws Autodesk.Revit.Exceptions.ArgumentException:
targetIndex is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover'.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetElement
Gets the Element object (either Host or Rebar) which provides the constraint.
Will throw exception if it's a multi target constraint.
Returns:
Returns the Element object (either Host or Rebar) which provides the constraint.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
Multi target constraint. Consider using the indexed version of the method.
-or-
The RebarConstraint should not be of RebarConstraintType 'ToSurface'.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetElement(System.Int32)
Gets the Element object (either Host or Rebar) which provides the constraint. Will return the Element which contains the face at targetIndex.
targetIndex:
The index of the target. Should be between 0 and NumberOfTargets().
Returns:
Returns the Element object (either Host or Rebar) which provides the constraint. Will return the Element which contains the face at targetIndex.
Throws Autodesk.Revit.Exceptions.ArgumentException:
targetIndex is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint should not be of RebarConstraintType 'ToSurface'.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.GetRebarConstrainedHandle
Gets the RebarConstrainedHandle for which this constraint is.
Returns:
Returns the RebarConstrainedHandle for which this constraint is.
Since:
2025

Autodesk.Revit.DB.Structure.RebarConstraint
A class representing a constraint on a handle of a rebar element.
Remarks:
For Shape Driven Rebar Constraints:
Each handle on a rebar is defined by a plane, and can be constrained along the
direction perpendicular to a surface. Rebar constraints work by locking the
handle planes to targets. These targets can be: surfaces of host elements (faces or cover),
the handle planes of other Rebar element or any generic surface.
A special case is for of a straight, standard style bar, running perpendicular
to the plane of the stirrup bar. This bar can constrain itself to distinct locations
along bends in stirrup bars - points located at 0 degrees, 45 degrees, 90 degrees,
etc. around each bend. This is done by simultaneously locking both the straight
bar's edge handle and its planar position handle to one or both of the stirrup edges
adjacent to the bend in the stirrup.
Usually, to form a constraint, the handle plane and the reference plane must be parallel.
However, bar end or segment handles can be constrained to planes at angles up to 84 degrees.
Arc-shaped rebar is a special case, and can form constraints to concentric host surfaces.
For Free Form Rebar Constraints:
Each handle of the Rebar can be constrained to multiple host faces or to the face cover.
In order to create a Free Form Rebar Constraint you will need:
RebarConstraintsManager which will manage the constraint.  The rebar handle you want to constraint.  A list of target references which must be element faces to which this handle is constrained.  A Boolean value specifying that the constraint is to cover or directly to face. It will be the same value for all target references A double value that represent the  offset distance from the rebar handle to target references.
RebarConstraints for Free Form Rebar should be created using the Create method and then added to
the RebarConstraintsManager using the method SetPreferredConstraintForHandle.
Since:
2014